[{"id":1593217860,"title":"This is a test","author":"Andrea Farinacci","date":"June 26, 2020","time":"19:31","thumbnail":"/images/logo512.png","content":"This is a test\n<br>\n*italic*\n<br>\n- The file synchronization will keep one file of the workspace synced with one or multiple files in **Google Drive**, **Dropbox** or **GitHub**.\n\t> Before starting to sync files, you must link an account in the **Synchronize** sub-menu.\n\n## Open a file\n\nYou can open a file from **Google Drive**, **Dropbox** or **GitHub** by opening the **Synchronize** sub-menu and clicking **Open from**. Once opened in the workspace, any modification in the file will be automatically synced.\n\n# Publication\n\nPublishing in StackEdit makes it simple for you to publish online your files. Once you're happy with a file, you can publish it to different hosting platforms like **Blogger**, **Dropbox**, **Gist**, **GitHub**, **Google Drive**, **WordPress** and **Zendesk**. With [Handlebars templates](http://handlebarsjs.com/), you have full control over what you export.\n## SmartyPants\n\nSmartyPants converts ASCII punctuation characters into \"smart\" typographic punctuation HTML entities. For example:\n\n|                |ASCII                          |HTML                         |\n|----------------|-------------------------------|-----------------------------|\n|Single backticks|`'Isn't this fun?'`            |'Isn't this fun?'            |\n|Quotes          |`\"Isn't this fun?\"`            |\"Isn't this fun?\"            |\n|Dashes          |`-- is en-dash, --- is em-dash`|-- is en-dash, --- is em-dash|\n"},{"id":1593201600,"title":"When to worry about Letter Reversals","author":"Christina Murray","date":"June 26, 2020","time":"15:00","thumbnail":"/images/letterreversals3.png","content":"\nLetter reversals are common when a child is first learning how to read. To understand why we need to investigate how our brains process spoken and written language. Spoken language is naturally picked up by using various language centers in the brain. The human brain was not designed to decode written language. This means we are using parts of our brain that were designed to perform entirely different tasks. One of the areas of the brain responsible for reading is the visual cortex. This part of the brain was designed for us to recognize things like objects and faces. For example, here are various pictures of chairs.\n\n![Chairs](/images/letterreversals3.png 'Chairs')\n\nDespite each one of them looking quite different, we recognize each one of the being a chair. We can group them all together and identify them under one category name because they share specific qualities. In this case, they all have a place to rest your bottom and your back. A child can use their sense of object constancy to accurately identify a rocking chair as a chair even if they have never seen one before. Now let us look at this concept in a different way:\n\n![Chairs Flipped](/images/letterreversals2.png 'Chairs Flipped')\n\nEven though the we are looking at the object from a different vantage point, we can still identify this object as a chair. The visual cortex gives us a sense of visual form constancy so we can still identify the object as a chair even if it is flipped upside down or backwards. The visual cortex is wired to be able to identify an object no what changes it may have in its orientation or size in space.\n\nNow here is where things get complicated. The rules of form constancy do not apply when learning the letters and learning how to read. For example, a child is presented with the letter “b”. Later the same child is presented with the letter “d”. To a child who has mastered form constancy, will looked at both of those letters and think they are the same. We now\n\n![Letters: b d p q](/images/letterreversals1.png 'Letters: b d p q')\n\nmust explain to the child that rules that have applies to every other object in the past no longer apply with letters. The process of reading requires an overruling of the previously understood concept of object form constancy.\n\nTo even a smart child, each one of these letters is a bubble with a stick attached to it. Every child goes through the same process of rewiring an already understood concept of form constancy to understand that each one these letters are separate objects. This process takes time for the child’s brain to rewire itself to embed the new concepts. Letter reversals should decrease as the child gains reading experience but can be expected until seven. If letter reversals are persisting past age seven, there is may be an underlying visual processing problem.\n\n![Brain Letter Reversals](/images/letterreversals4.png 'Brain Letter Reversals')\n\n###### _in literacy acquisition. Pegado F, Nakamura K and Hannagan T (2014)._\n\n<br>\n<br>\nFor more information on this topic:\n\n<http://www.unicog.org/publications/1-s2.0-S1364661311000738-main.pdf>\n\n[https://cdn.ymaws.com/www.covd.org/resource/resmgr/position_papers/vision-learning-dyslexia\\_-_j.pdf](https://cdn.ymaws.com/www.covd.org/resource/resmgr/position_papers/vision-learning-dyslexia_-_j.pdf)\n\n<https://www.frontiersin.org/articles/10.3389/fpsyg.2014.00703/full>\n"}]